"""
Кол-во сегментов в строке
Дана строка. Каждое отдельное слово это сегмент. Сколько сегментов в строке?

Sample Input:

    Hello, my name is John
Sample Output:

    5
"""
print(len(list(input().split(" "))))

