"""
Найдите первое вхождение подстроки в строку
Верните индекс первого вхождения подстроки в строку или -1,
если подстрока не является частью строки.
Sample Input:

    hello
    ll
Sample Output:

    2
"""

x = input()
y = input()
print(x.find(y))
